In [7]:
import pandas as pd
import numpy as np

In [23]:
from numpy.random import randn
np.random.seed(101)

In [31]:

df = pd.DataFrame(randn(5,4), index ='1 2 3 4 5'.split(),columns='A B C D'.split())

In [33]:
df

          A         B         C         D
1  0.386030  2.084019 -0.376519  0.230336
2  0.681209  1.035125 -0.031160  1.939932
3 -1.005187 -0.741790  0.187125 -0.732845
4 -1.382920  1.482495  0.961458 -2.141212
5  0.992573  1.192241 -1.046780  1.292765

In [36]:
bol = df >1
df[bol]

    A         B   C         D
1 NaN  2.084019 NaN       NaN
2 NaN  1.035125 NaN  1.939932
3 NaN       NaN NaN       NaN
4 NaN  1.482495 NaN       NaN
5 NaN  1.192241 NaN  1.292765

In [63]:
df[df['B']>1]['B']

1    2.084019
2    1.035125
4    1.482495
5    1.192241
Name: B, dtype: float64

In [66]:
df[(df['B']>1) & (df['D']>1)]

          A         B        C         D
2  0.681209  1.035125 -0.03116  1.939932
5  0.992573  1.192241 -1.04678  1.292765

In [68]:
df.reset_index()

  index         A         B         C         D
0     1  0.386030  2.084019 -0.376519  0.230336
1     2  0.681209  1.035125 -0.031160  1.939932
2     3 -1.005187 -0.741790  0.187125 -0.732845
3     4 -1.382920  1.482495  0.961458 -2.141212
4     5  0.992573  1.192241 -1.046780  1.292765

In [74]:
col = 'CE RO SP RJ SC'.split()
col
df['ESTADO'] = col
df
df.set_index('ESTADO')

               A         B         C         D
ESTADO
CE      0.386030  2.084019 -0.376519  0.230336
RO      0.681209  1.035125 -0.031160  1.939932
SP     -1.005187 -0.741790  0.187125 -0.732845
RJ     -1.382920  1.482495  0.961458 -2.141212
SC      0.992573  1.192241 -1.046780  1.292765